html/questions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-07 Sat 17:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>questions</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<header>
    <script src="setup-initial-theme.js"></script>
    <div style="display: flex; flex-direction: row; justify-content: space-between; align-items: center;">
        <a style="color: inherit; text-decoration: none" href="/">
            <svg id="nebula-logo" x="0px" y="0px" width="50px"
                 viewBox="0 0 290.513 290.513" style="enable-background:new 0 0 290.513 290.513;" xml:space="preserve">
                <g>
                    <g>
                        <path d="M168.684,103.086c-58.679,0-93.713,17.515-93.713,46.857c0,18.344,27.214,28.114,46.857,28.114
                                 c46.327,0,46.857-22.472,46.857-23.428l-9.367-0.141c-0.009,0.141-1.354,14.198-37.49,14.198
                                 c-16.976,0-37.485-8.359-37.485-18.743c0-23.124,32.317-37.485,84.342-37.485c68.312,0,112.456,20.233,112.456,51.542
                                 c0,32.818-50.989,70.252-145.49,74.975l0.469,9.357c101.36-5.065,154.393-46.262,154.393-84.333
                                 C290.511,126.996,242.689,103.086,168.684,103.086z"/>
                        <path d="M215.541,154.628c0-18.344-27.214-28.114-46.857-28.114c-46.327,0-46.857,22.472-46.857,23.428
                                 l9.367,0.141c0.009-0.141,1.354-14.198,37.49-14.198c16.976,0,37.485,8.359,37.485,18.743c0,23.124-32.317,37.485-84.342,37.485
                                 c-68.312,0-112.456-20.233-112.456-51.542c0-32.818,50.989-70.252,145.49-74.975l-0.469-9.357C53.032,61.303,0,102.5,0,140.571
                                 c0,37.003,47.822,60.914,121.827,60.914C180.506,201.485,215.541,183.97,215.541,154.628z"/>
                        <path d="M51.542,107.771c0,7.75-6.307,14.057-14.057,14.057v9.371c7.75,0,14.057,6.307,14.057,14.057h9.371
                                 c0-7.75,6.307-14.057,14.057-14.057v-9.371c-7.75,0-14.057-6.307-14.057-14.057H51.542z M56.228,131.214
                                 c-1.335-1.776-2.919-3.364-4.7-4.7c1.781-1.335,3.364-2.924,4.7-4.7c1.335,1.776,2.919,3.364,4.7,4.7
                                 C59.147,127.849,57.563,129.438,56.228,131.214z"/>
                        <path d="M238.969,187.428h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                                 C230.563,168.685,238.969,177.091,238.969,187.428z M243.655,156.095c2.08,3.13,4.775,5.82,7.905,7.905
                                 c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C238.88,161.919,241.574,159.225,243.655,156.095z"/>
                        <path d="M103.085,206.17h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                                 c10.337,0,18.743,8.406,18.743,18.743h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 C111.491,224.913,103.085,216.507,103.085,206.17z M98.399,237.503c-2.08-3.13-4.775-5.82-7.905-7.905
                                 c3.13-2.08,5.82-4.775,7.905-7.905c2.08,3.13,4.775,5.82,7.905,7.905C103.174,231.679,100.479,234.373,98.399,237.503z"/>
                        <path d="M182.741,84.343h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743V65.6
                                 C174.335,65.6,182.741,74.006,182.741,84.343z M187.427,53.01c2.08,3.13,4.775,5.82,7.905,7.905
                                 c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C182.652,58.834,185.346,56.14,187.427,53.01z"/>
                        <rect x="98.399" y="135.885" width="9.371" height="9.371"/>
                        <rect x="107.77" y="149.942" width="9.371" height="9.371"/>
                        <rect x="168.684" y="168.685" width="9.371" height="9.371"/>
                        <rect x="182.741" y="145.257" width="9.371" height="9.371"/>
		                    <rect x="215.541" y="187.428" width="9.371" height="9.371"/>
		                    <rect x="154.627" y="215.542" width="9.371" height="9.371"/>
	                  </g>
                </g>
            </svg>
        </a>
        <div>
            <input type="checkbox" id="theme-switcher">
            <label id="theme-switcher-label" for="theme-switcher"></label>
        </div>
    </div>
</header>
</div>
<div id="content" class="content">
<h1 class="title">questions
<br />
<span class="subtitle">Last modified on May 07, 2022</span>
</h1>
<p>
(those without easy answers.)<br />
</p>

<div id="outline-container-org57d0639" class="outline-2">
<h2 id="org57d0639">Should I be pure or applied?</h2>
</div>
<div id="outline-container-org2e41b92" class="outline-2">
<h2 id="org2e41b92"><a href="http://www.catb.org/~esr/faqs/smart-questions.html">how to ask good questions</a></h2>
<div class="outline-text-2" id="text-org2e41b92">
<p>
I see some Gricean Maxims at work here. Be relevant, have the context, be concise. I also see some <a href="private/utilitarianism.html#ID-6ac23ec1-38c9-4092-8ebb-a6efd4fa1839">Utilitarianism</a>, in that hackers want public forums to increase the flow of useful information and make it more efficient.<br />
</p>
</div>
</div>
<div id="outline-container-org4f97bb6" class="outline-2">
<h2 id="org4f97bb6">what makes a subject &ldquo;interesting&rdquo; to a given person?</h2>
<div class="outline-text-2" id="text-org4f97bb6">
<p>
Why are some people so fascinated by video games, but it doesn&rsquo;t even ring a bell for others? Why do some people love the taste of pineapple on on pizza, and others hate it? What makes us like something? And how does our &ldquo;taste&rdquo; evolve over time &#x2013; how should it evolve over time?<br />
</p>

<p>
Proto-answer: it depends how rich of a <a href="context.html#ID-8d27adad-158b-4fa4-b31b-5f793d0b8341">context</a> the person in question has for that particular subject. Once you&rsquo;ve built up a &ldquo;history&rdquo; with a particular thing, it starts to have a lot of context build up, and it naturally becomes more interesting to you.<br />
</p>

<p>
Proto-answer 2: It depends on the frame you approach it with. I feel like every food that I don&rsquo;t like (provided that a good amount of other people like it,) I just haven&rsquo;t found the right frame with which to approach it yet.<br />
</p>
</div>
</div>
<div id="outline-container-orga3a3070" class="outline-2">
<h2 id="orga3a3070">What standard of evidence should I demand to update my beliefs about something?</h2>
<div class="outline-text-2" id="text-orga3a3070">
<p>
In other words, how much of a skeptic should I be?<br />
</p>
</div>
</div>
<div id="outline-container-org5c4a58e" class="outline-2">
<h2 id="org5c4a58e">&ldquo;Flat&rdquo; design (monorepo) vs. hierarchical?</h2>
<div class="outline-text-2" id="text-org5c4a58e">
<p>
For example, monorepo vs. structured w/ nice neat folders. Monorepo is easier to just scan and find what you want, simply use the power of search, but can get out of control if too large. OTOH, there is a strong argument for decomposition into folders/branches/etc. Also, when making text notes, should I have big, sprawling things like <i>thoughts</i> or small, decomposed things? (Ideal answer: both)<br />
</p>
</div>
</div>
<div id="outline-container-org655505a" class="outline-2">
<h2 id="org655505a">How does someone decide their values?</h2>
</div>
<div id="outline-container-org9b2cbae" class="outline-2">
<h2 id="org9b2cbae">Are binaries valid things?</h2>
</div>
<div id="outline-container-orgb1a8dee" class="outline-2">
<h2 id="orgb1a8dee">Where are frameworks useful? How much &ldquo;meta-&rdquo; is too much?</h2>
</div>
<div id="outline-container-org2e826ab" class="outline-2">
<h2 id="org2e826ab">Do aesthetics matter?</h2>
</div>
<div id="outline-container-org858ab5e" class="outline-2">
<h2 id="org858ab5e">Are other people smart/headed on the right track when it comes to things?</h2>
</div>
<div id="outline-container-orgcc2a6ba" class="outline-2">
<h2 id="orgcc2a6ba">How do I <i>effectively</i> customize my life? That is, taking the default settings that are <b>important</b> to change, and changing them.</h2>
</div>
<div id="outline-container-orgaae2f11" class="outline-2">
<h2 id="orgaae2f11">Other people&rsquo;s questions:</h2>
<div class="outline-text-2" id="text-orgaae2f11">
</div>
<div id="outline-container-orgc5fbc88" class="outline-3">
<h3 id="orgc5fbc88"><a href="https://patrickcollison.com/questions">https://patrickcollison.com/questions</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <p>Made with <span class="heart">♥</span> using
    <a href="https://orgmode.org/">org-mode</a>.
    Source code is available
    <a href="https://github.com/ketan0/digital-laboratory">here</a>.
  </p>
</footer>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
<script src="setup-theme-switcher.js"></script>
<script src="insert-intext-citation.js"></script>
</div>
</body>
</html>
